Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh340-v2.tmx
Source language: bo
Languages: en

source: ང་ལ་སེམས་དགའ་བར་གྱིས་ཤིག་དང་དུད་འགྲོའི་སྐྱེ་གནས་དང་བྲལ་བར་འགྱུར་ཡང་སྲིད་དོ་ཞེས་བཀའ་སྩལ་ཏོ། །
en: Let your mind be filled with joy at the thought of me, and you may even be released from rebirth in the animal realm.”

source: དེ་ནས་དེ་བཅོམ་ལྡན་འདས་ལ་སེམས་དགའ་བར་གྱུར་ཏེ། ཤི་འཕོས་ནས་དུས་ལས་འདས་ཏེ་མཉན་དུ་ཡོད་པ་དེ་ཉིད་དུ་ཚོང་དཔོན་ཞིག་གི་ཁྱིམ་དུ་ཉིང་མཚམས་སྦྱར་ནས།
en: Filled with joy at the thought of the Blessed One, the bull died shortly thereafter, transmigrated, and took rebirth in the house of a merchant in Śrāvastī.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཞིག་བཙས་ནས།
en: After nine or ten months had passed the child was born, and he was well proportioned, pleasing to the eye, and beautiful.

source: འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared him on milk, yogurt, butter, ghee, and milk solids,

source: དེ་གང་གི་ཚེ་ལོ་བདུན་ལོན་པར་གྱུར་པ་དེའི་ཚེ། དེས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དད་པ་རྙེད་ནས།
en: and when he was seven years of age, he found faith in the doctrine of the Blessed One.

source: དེས་ཕ་མ་གཉིས་ལ་གསོལ་ཏེ་རབ་ཏུ་བྱུང་ནས།
en: He asked for his parents’ permission and went forth,

source: དེས་ལོ་བདུན་ལོན་པ་ཁོ་ན་ཉིད་ན་བརྩོན་པ་དང་བསྒྲུབ་པ་དང་འབད་པས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དེས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་ཏེ་
en: and though he was just seven years old, he cast away all afflictive emotions through diligence, practice, and effort, and manifested arhatship.

source: དེས་དགྲ་བཅོམ་པ་ཐོབ་ནས་རྫུ་འཕྲུལ་གྱིས་འགྲོ་ཞིང་། གནས་གཞན་དང་གཞན་དག་ནས་ལོ་མའི་ནང་དུ་མེ་ཏོག་དང་འབྲས་བུ་རྣམས་བཅུག་སྟེཁྱེར་ཏེ་འོང་ཞིང་དགེ་འདུན་ལ་འབུལ་བར་བྱེད་དོ། །
en: After he manifested arhatship, he used his miraculous powers as a means of travel and would scoop flowers and fruits onto large leaves, carry them from one place to another, and bring them as offerings to the saṅgha.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་དེ་མཐོང་ནས་ཡ་མཚན་དུ་གྱུར་ཏོ། །
en: The monks were amazed when they saw this,

source: ཡ་མཚན་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ།
en: [The monks were amazed when they saw this,] so they requested the Blessed One,

source: བཙུན་པ་དགེ་ཚུལ་པ་འདིས་ལོ་བདུན་ལོན་ལགས་ན་ཡོན་ཏན་འདི་ལྟ་བུ་རྟོགས་པ་ལ་གཟིགས།
en: “Lord, tell us why this one, who went forth as a novice at just seven years of age, has achieved such great virtues.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One asked the monks,

source: ཁྱེད་ཀྱིས་གླང་གི་རྒྱུ་མ་ངས་ལྟོར་བཅུག་ནས་ཆོས་ཚིག་གསུམ་བསྟན་པ་དེ་མཐོང་ངམ།
en: “Did you see the bull whose intestines I put back into his stomach, and to whom I taught three lines of the Dharma?”

source: གསོལ་པ། བཙུན་པ་མཐོང་ལགས་སོ། །
en: “Yes, Lord, we saw him,” they replied.

source: དེ་ང་ལ་སེམས་དགའ་བར་བྱས་ནས་ཤི་འཕོས་ཏེ་དུས་ལས་འདས་ནསམཉན་དུ་ཡོད་པ་འདི་ཉིད་དུ་ཚོང་དཔོན་གྱི་ཁྱིམ་དུ་སྐྱེས་ནས།
en: “Filled with joy at the thought of me, he died, transmigrated, and was reborn in the house of a merchant here in Śrāvastī.

source: དེ་ངའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་སྟེ།
en: Then he went forth in my very doctrine,

source: ལོ་བདུན་ལོན་པ་ཁོ་ན་ན་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱས་སོ། །
en: and at just seven years of age cast away all afflictive emotions and manifested arhatship.”

source: གསོལ་པ། བཙུན་པ་དགེ་ཚུལ་ཕ་འདིས་ལས་ཅི་ཞིག་བགྱིས་ན་ལས་དེའི་རྣམ་པར་སྨིན་པས་གླང་དུ་སྐྱེས་ལགས་ལས་ཅི་བགྱིས་ན་
en: “Lord, what action did this novice take that ripened into his birth as a bull?” they inquired.

source: ལས་དེའི་རྣམ་པར་སྨིན་པས། དེ་ནས་ཤི་འཕོས་ནས་མིར་སྐྱེས་ལ་འདིས་བཅོམ་ལྡན་འདས་མཉེས་པར་བགྱིས་ཏེམི་མཉེས་པར་མ་བགྱིས་ནས་སྐྱེ་དགུའི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་རྣམས་ཕམ་པར་བགྱིས་ཏེ། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ནས་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བགྱིས་ལགས།
en: “What action did he take that, after he died and transmigrated, ripened into his birth as a human being, and that he pleased the Blessed One, did not displease him, surpassed those whose lifespans were one hundred years, cast away all afflictive emotions, and manifested arhatship?”

source: དགེ་སློང་དག་འདི་ཉིད་ཀྱིས་ལས་དེ་བྱས་ཤིང་བསགས་ཏེ།
en: “such are the actions that he committed and accumulated:

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུའི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ། བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་གདུལ་བྱའི་ཁ་ལོ་སྒྱུར་བ། བླ་ན་མེད་པ་ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་སྟེདེའི་གསུང་རབ་ལ་རབ་ཏུ་བྱུང་སྟེ་དགེ་སློང་ཆུའི་ཞལ་ཏ་བྱེད་པར་གྱུར་ཏེ། དེ་དགེ་འདུན་ལ་རིལ་བ་སྤྱི་བླུགས་ཀྱིས་ཆུ་འདྲིམ་པ་ལས།
en: “Monks, in times past, in this fortunate eon, when people lived as long as twenty thousand years, and the totally and completely awakened buddha endowed with perfect knowledge and perfect conduct, the sugata, the knower of the world, the tamer of persons, the charioteer, the unsurpassed one, the teacher of humans and gods, the blessed buddha known as Kāśyapa was in the world, he went forth in Buddha Kāśyapa’s doctrine, acted as water server for the monks, and distributed water from a small vase.

source: དགེ་སློང་དགྲ་བཅོམ་པ་གཞན་ཞིག་ཡེངས་པར་གྱུར་ཏེ། དེ་དེ་དང་ཐུག་ནས་ཆུའི་ཞལ་ཏ་བྱེད་པ་དེའི་རིལ་བ་ལག་ནས་ཤོར་ཏེ་ཆག་ནས།
en: “Another monk who was an arhat got distracted and bumped up against the serving monk, knocking the small vase from his hand and breaking it.

source: དེ་ཁྲོས་པས། དགྲ་བཅོམ་པ་དེ་ལ་སྨྲས་པ། འདི་ནི་གླང་དིར་པོ་བཞིན་དུ་ཆེ་ཞིང་ཚོར་ཕྲིག་མེད་པ་ཞིག་གོ་ཞེས་བྱས་ནས།
en: In anger, the serving monk shouted at him, ‘This one’s like a thundering bull—huge and oblivious!’

source: དེའི་ཚིག་དེ་དགྲ་བཅོམ་པ་དེས་ཐོས་ནས་དེས་དེ་ཕྱོགས་གཅིག་ཏུ་ཁྲིད་དེ་སྨྲས་པ།
en: “When he heard what he said, the arhat took him aside and asked,

source: བཙུན་པ་ཁྱོད་བདག་སུ་ཡིན་པ་དང་ང་སུ་ཡིན་པ་ཤེས་སམ་དེས་སྨྲས་པ། ངས་ཤེས་ཏེ
en: ‘Lord, do you know who I am?’

source: ཁྱོད་ཀྱང་རབ་ཏུ་བྱུང་བ་ཡིན་ལ། ང་ཡང་རབ་ཏུ་བྱུང་བ་ཡིན་ནོ། །
en: “ ‘I know that you have gone forth,’ he replied, ‘as have I.’

source: དེས་སྨྲས་པ། འོ་བུ་ཅག་རབ་ཏུ་བྱུང་བར་འདྲ་མོད་ཀྱི། ཁྱོད་ནི་བཅིང་བ་ཐམས་ཅད་ཀྱིས་བཅིངས་པའི་སོ་སོའི་སྐྱེ་བོ་ཡིན་ལ། ང་ནི་འཆིང་བ་ཐམས་ཅད་ལས་གྲོལ་བ་ཡིན་ན
en: “ ‘Though we two are like brothers in having gone forth,’ he said, ‘you are an ordinary person, bound by every fetter, and I have been liberated from every fetter.

source: ཁྱོད་ཀྱིས་ཚིག་རྩུབ་པོ་སྨྲས་ཀྱིས། ཉེས་པ་ལ་ཉེས་སོ་ཞེས་བཤགས་པར་གྱིས་ཤིག །
en: You must confess the mistake you’ve made by speaking harshly to me.

source: ཁྱོད་འཁོར་བ་ན་འཁོར་ཞིང་མི་སྡུག་པའི་ལས་ཀྱི་འབྲས་བུ་རྙེད་ཏ་རེ་ཞེས་བྱས་སོ། །
en: Otherwise you are certain to roam in saṃsāra and meet with the results of your ugly act.’

source: དེ་ནས་དེ་ཐོས་མ་ཐག་ཏུ་དགེ་སློང་དེ་འགྱོད་པ་ཆེན་པོ་སྐྱེས་ཏེ། དེས་དགེ་སློང་དེའི་རྐང་པ་ལ་ཕྱག་འཚལ་ནས་བཟོད་པ་གསོལ་ཏེ།
en: “When he heard this the serving monk was seized with regret, bowed down at his feet, and asked his forgiveness.

source: ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་
en: After that he practiced pure conduct all his life,

source: འཆི་ཀར་སྨོན་ལམ་བཏབ་པ་བདག་གིས་འདི་འདྲ་བའི་ཡོན་གནས་ཀྱི་མཆོག་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་འདི་ཅི་ནས་ཀྱང་བདག་ལ་སྨིན་པར་མ་གྱུར་ཅིག །
en: and at the time of his death he prayed, ‘May I not meet with the results of the act of speaking harshly to this person, so supremely worthy of offerings.

source: འདི་ལྟར་བདག་གིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ཀྱང་ཡོན་ཏན་གྱི་ཚོགས་ཅི་ཡང་མ་ཐོབ་ཀྱིས།
en: While I may not have attained any great virtues, still I have gone forth and practiced pure conduct all my life.

source: ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ལུང་བསྟན་པ་གང་ཡིན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་བདག་གིས་མཉེས་པར་བྱེད་པར་གྱུར་ཅིག །
en: Therefore, may I please and not displease Uttara, the young brahmin prophesied by the totally and completely awakened Buddha Kāśyapa to be the next blessed buddha.

source: མི་མཉེས་པར་བྱེད་པར་མ་གྱུར་ཅིག །དེ་ཁོ་ནའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས། ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་ཏེ་དགྲ་བཅོམ་པ་ཉིད་མངོན་སུམ་དུ་བྱེད་པར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: Going forth in his doctrine alone may I cast away all afflictive emotions, and manifest arhatship.’

source: དེའི་ཚེ་ཆུའི་ཞལ་ཏ་བྱེད་པར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་དགེ་ཚུལ་པ་འདི་ཉིད་ཡིན་ཏེ།
en: The one who was the water-serving monk then is none other than this novice.

source: དེས་དེར་ཁྲོས་ནས་དགྲ་བཅོམ་པ་དེ་ལ་ཚིག་རྩུབ་པོ་སྨྲས་པའི་ལས་དེའི་རྣམ་པར་སྨིན་པས་ཚེ་རབས་ལྔ་བརྒྱར་གླང་དུ་སྐྱེས་སོ། །
en: The act of becoming angry and speaking harshly to the arhat ripened such that for five hundred lifetimes he took rebirth as a bull.

source: འཆི་ཀར་སྨོན་ལམ་བཏབ་སྟེ།
en: Yet at the time of his death he prayed,

source: དགེ་སློང་དག་ང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་དང་ཤིན་ཏུ་མཉམ་པ་དང་། ཤུགས་མཉམ་པ་དང་། མཛད་པ་མཉམ་པ་དང་། ཐབས་མཉམ་པ་བརྙེས་པར་གྱུར་ནས་
en: “So it is, monks, now that I myself have become the very equal of the totally and completely awakened Buddha Kāśyapa—equal in strength, equal in deeds, and equal in skillful means—

source: སྙིང་རྗེ་བཟང་པོ་ཞེས་བྱ་བ་ནི།
en: The Story of Good Compassion

source: གླེང་གཞི་ཡངས་པ་ཅན་ན་བཞུགས་ཏེ། དེའི་ཚེ་ཡངས་པ་ཅན་ན་སྡེ་དཔོན་སེང་གེ་ཞེས་བྱ་བ་ཞིག་འདུག་སྟེ།
en: When the Blessed One was in Vaiśālī, there lived a certain army chief named Siṃha.

source: ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས་
en: One day his wife conceived,

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཚན་པོ་ཆེའི་སྟོབས་དང་ལྡན་པ་ཞིག་བཙས་ཏེ
en: and after nine or ten months had passed she gave birth to a child who was well proportioned, pleasing to the eye, beautiful, and endowed with tremendous strength.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས་མིང་སྙིང་རྗེ་བཟང་པོ་ཞེས་བཏགས་སོ། །
en: At the elaborate feast celebrating his birth they named him Good Compassion.

source: དེ་ནས་ཁྱེའུ་སྙིང་རྗེ་བཟང་པོ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུ་རྣམས་ཀྱིས་བསྐྱེད་བསྲིངས་ཏེ།
en: They reared him on milk, yogurt, butter, ghee, and milk solids,

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཁྱེའུ་དེ་ཡི་གེ་སློབ་ཏུ་བཅུག་སྟེ། རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བའི་རྒྱལ་པོ་རྣམས་ཀྱིས་བཟོའི་གནས་དང་། ལས་ཀྱི་གནས་ཐ་དད་པ་འདི་ལྟ་སྟེ་གླང་པོ་ཆེ་ཞོན་པ་དང་། རྟ་ཞོན་པ་དང་། མཚོན་ཆ་བཅང་བ་དང་། འཕོང་དང་མདུན་དུ་བསྣུར་བ་དང་། ཕྱིར་བསྣུར་བ་དང་། གཡུལ་ལས་འབྱུང་བར་བྱ་བ་དང་། ལྕགས་ཀྱུ་གཟུང་བ་དང་། ཞགས་པ་གཟུང་བ་དང་། མདའ་བོ་ཆེ་འཕང་བ་དང་། རྡོ་རྗེ་རྩེ་གཅིག་པ་འཕང་བ་དང་། མཚོན་རྩེ་གཅིག་པ་གདབ་པ་དང་། འཁོར་ལོ་འཕང་བ་དང་། གཅད་པ་དང་། གཤེག་པ་དང་། ལག་པས་གཟུང་བ་དང་། རྐང་པའི་སྟབས་དང་། མགོ་བོ་བསྐྱབ་པ་དང་། རྒྱང་མར་འཕང་བ་དང་། སྒྲ་གྲག་པར་འཕང་བ་དང་། གནད་དུ་འཕང་བ་དང་། གདོན་མི་ཟ་བར་ཕོག་པར་བྱ་བ་དང་། ཚབས་ཆེར་གཏང་བ་རྣམས་ཀྱང་
en: and as the young man grew up, they made him study letters, and trained him in all the different fields of craft and skill in which duly consecrated rulers of the royal caste train, such as how to ride an elephant, how to ride horseback, how to wield a weapon, and how to shoot an arrow, advance, retreat, wage war, grasp with an iron hook, wield a lasso, shoot a spear, throw a single-pointed vajra, throw other single-pointed weapons, and throw a disk; how to cut, cleave, grapple and hold, employ footwork, guard one’s head, strike from a distance, and strike at the noise of an unseen enemy; and how to target the vital points, take infallible aim, and maximize damage.

source: དེ་ནས་དེ་མ་གྲངས་ནས་འཕྱོན་མ་རྣམས་ལ་ཡང་ཞུགས་སོ། །
en: But this was not enough to satisfy him, and he had intercourse with prostitutes.

source: ཕྱིས་རེ་ཞིག་ན་དེ་ཕས་མཛའ་སྡེའི་ཁྲོད་དུ་བཏང་ནས་
en: His father sent him off with a group of friends,

source: མཛའ་སྡེ་དེ་དག་དཔྱིད་ཀྱི་དུས་སུ་ཤིང་གྲིབ་མེ་ཏོག་རྒྱས་པ། ནེ་ཙོ་དང་རི་སྐེགས་དང་རྨ་བྱ་དང་ཁུ་བྱུག་དང་ཤང་ཤང་ཏེའུ་རྣམས་སྐད་འབྱིན་པའི། སྐྱེད་མོས་ཚལ་གྱི་ནགས་ཁྲོད་དུ་སྨད་འཚོང་མའི་གཙོ་མོ་ཁྲིད་དེ་སོང་ནས་
en: and one day in the spring, when many trees were in flower, and the parrots, mountain birds, cuckoos, peacocks, and jīvaṃjīva birds began to call out, the men brought the foremost courtesan into the forest.

source: དེ་དག་དེ་ན་འཁོད་པ་ལས་སྨད་འཚོང་མའི་ཕྱིར་ཐབ་མོ་བྱུང་སྟེ
en: As they sat there, they began to quarrel over the courtesan.

source: ཁྱེའུ་སྙིང་རྗེ་བཟང་པོ་ཁྲོས་པས་མཛའ་སྡེ་གསུམ་བསད་ནས།
en: In anger, young Good Compassion killed three men in the group of friends.

source: མཛའ་སྡེ་རྣམས་དོང་སྟེ་སྡེ་དཔོན་སེང་གེ་ལ་སྨྲས་སོ། །
en: The group of friends went and told the army chief Siṃha.

source: དེ་ནས་སྡེ་དཔོན་སེང་གེས་དེ་ཐོས་ནས་བུ་དེ་བུ་མ་ཡིན་པར་བསྒྲགས་ཏེ་ཁྱིམ་ནས་ཀྱང་བསྐྲད་དོ། །
en: When he heard about this, the army chief Siṃha declared, “That boy is no child of mine!” and threw him out of the house.

source: དེ་ནས་ཡངས་པ་ཅན་གྱི་ལིཙྪ་བཱི་རྣམས་ཀྱིས་དེ་གསོད་དུ་བཏང་སྟེ། ཀ་ར་བཱི་རའི་མེ་ཏོག་གི་ཕྲེང་བས་མགུལ་པ་དཀྲིས་ནས། གཤེད་མ་ལ་གཏད་དེ།
en: The Licchavis of Vaiśālī sentenced him to death, draped his neck with garlands of oleander flowers, and handed him over to the executioners.

source: གཤེད་མའི་མི་གོས་སྔོན་པོ་བགོས་ལ་རལ་གྲི་ཕྱུང་སྟེ་རྔ་སྒྲ་དྲག་པོ་སྒྲོགས་པ་དག་གིས། ཁྲིད་ནས་ལམ་པོ་ཆེའི་མདོ་རྣམས་སུ་བསྒྲགས་ཏེ།
en: Clad in black , the executioners unsheathed their swords, and with a thundering of drums they led him to the crossroads on the main highway.

source: གསད་པའི་སར་ཕྱིན་ཏུ་ཉེ་བ་དང་དེ་སྲོག་གི་ཕྱིར་འཇིགས་ཤིང་སྐྲག་ནས་ཕན་ཚུན་དུ་ལྟ་སྟེ།
en: As they neared the place where he was to be executed, in terror for his life he cast all about, thinking,

source: བདག་ཕོངས་ཤིང་དཀོས་ཐག་པ་དང་སྡུག་པའི་སྐྱབས་བྱེད་པ་དང་སྲོག་ཕངས་པ་སྦྱིན་པ་སུ་ཞིག་ཡོད་ཞིག་གུ་སྙམ་མོ། །
en: “Who can protect me from such desolation, distress, and suffering? Who can save my precious life?”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་བགྲོད་པ་གཅིག་པུའི་ལམ་སྟོན་པ། རྣམ་པ་གཉིས་ཀྱི་ཤེས་བྱ་དང་ཡེ་ཤེས་ལ་མངའ་བརྙེས་པ། མ་འདྲེས་པའི་དྲན་པ་ཉེ་བར་གཞག་པ་གསུམ་ལ་མཁས་པ། མི་འཇིགས་པ་བཞིས་མི་འཇིག་པ། འགྲོ་བ་ལྔར་འགྲོ་བ་ལས་རྣམ་པར་གྲོལ་བ། སྐྱེ་མཆེད་དྲུག་ལ་མཁས་པ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་ལ་སྤྱོད་ཡུལ་བ། རྣམ་པར་ཐར་པ་བརྒྱད་ལ་བསམ་གཏན་པ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་ལ་སྙོམས་པར་འཇུག་པ། སྟོབས་བཅུའི་སྟོབས་དང་ལྡན་པ། ཡང་དག་པའི་སེང་གེའི་སྒྲ་ཆེན་པོ་སྒྲོགས་པ་རྣམས་ནི་ཆོས་ཉིད་ཀྱིས་ཉིན་དུས་གསུམ་མཚན་དུས་གསུམ་སྟེ། ཉིན་མཚན་དུས་དྲུག་ཏུ་སངས་རྒྱས་ཀྱི་སྤྱན་གྱིས་འཇིག་རྟེན་ལ་གཟིགས་ཏེ།
en: The blessed buddhas, teachers of the one path to be traversed, with mastery over wisdom and the two types of knowable objects, in command of the three kinds of sterling equanimity, fearless by means of the fourfold fearlessness, freed from migration through the five destinies, keen in the six sense bases, practiced in the seven limbs of enlightenment, focused on the eight liberations, absorbed in the nine successive meditative absorptions, possessing all ten of the ten powers, whose proclamations are the great roaring of a perfect lion, by nature regard the world with their buddha eyes six times throughout the day and night—three times by day and three times by night. These are their thoughts as they look out in wisdom:

source: ཁྱེའུ་སྙིང་རྗེ་བཟང་པོ་གདུལ་བའི་དུས་ལ་བབ་བོ་སྙམ་དུ་དགོངས་ནས་སྤྲེའུ་རྫིང་གི་འགྲམ་ནས་མི་སྣང་བར་གྱུར་ཏེ། ཁྱེའུ་སྙིང་རྗེ་བཟང་པོའི་མདུན་དུ་བཞུགས་སོ། །
en: “The time has come to tame young Good Compassion.” He disappeared from the banks of Markaṭahrada and set out toward young Good Compassion.

source: དེ་ནས་ཁྱེའུ་སྙིང་རྗེ་བཟང་པོས་ཐག་རིང་པོ་ཞིག་ནས་བཅོམ་ལྡན་འདས་མཐོང་ངོ་། །
en: Young Good Compassion saw the Blessed One from a distance.

source: མཐོང་ནས་ཀྱང་ཞབས་ལ་ཕྱག་འཚལ་ཏེ་གསོལ་པ།
en: Drawing close, he bowed down at the feet of the Blessed One and implored the Blessed One,

source: བཅོམ་ལྡན་འདས་བདག་ལ་དཀའ་བ་མཛད་ཅིང་སྲོག་ཕངས་པའི་སྦྱིན་པ་མཛད་དུ་གསོལ།
en: “Please undertake the difficult task of saving my precious life!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། གཞོན་ནུ་ཁྱོད་ད་ནི་སྲོག་ཆུད་ཟ་བར་འགྱུར་བའི་འཇིགས་པ་མེད་ཀྱིས་མ་སྐྲག་ཤིག་ཅེས་བཀའ་སྩལ་ནས།
en: “Young man,” the Blessed One told him, “don’t be afraid. Your life will not be lost.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཡངས་པ་ཅན་གྱི་མི་རྣམས་ལ་བཀའ་སྩལ་པ།
en: Then the Blessed One spoke to the people of Vaiśālī, saying,

source: བཞིན་བཟངས་དག་ཁྱེའུ་འདི་བསད་དེ་ཅི་རུང་གིས་ཐོང་ཤིག །
en: “My friends, what is the use of killing this young man? Release him.”

source: ཡངས་པ་ཅན་གྱི་མི་རྣམས་ཀྱིས་གསོལ་པ། བཙུན་པ་གལ་ཏེ་རབ་ཏུ་བྱུང་ན་ནི་བཏང་བར་འཚལ་ལོ་ཞེས་གསོལ་ཏོ། །
en: “Lord,” the people of Vaiśālī replied, “if he goes forth, we shall release him.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཁྱེའུ་དེ་རབ་ཏུ་ཕྱུང་ཞིང་བསྙེན་པར་རྫོགས་པར་མཛད་ནས། དེ་ལ་ལུང་ཡང་ཕོག་སྟེ།
en: So the Blessed One led him to go forth as a novice, conferred on him full ordination, and instructed him.

source: དེ་ནས་དགེ་སློང་རྣམས་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་གསོལ་པ། བཙུན་པ་ཁྱེའུ་སྙིང་རྗེ་བཟང་པོ་མ་གྲངས་པའི་སླད་དུ། ཡངས་པ་ཅན་གྱི་མི་རྣམས་ཀྱིས་གསོད་དུ་བཏང་བ་ལས་བཅོམ་ལྡན་འདས་ཀྱིས་ཐར་བར་མཛད་དེགཡུང་དྲུང་གི་མཐར་ཐུག་པ། གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་པ་ལ་གཟིགས།
en: “Lord,” the monks requested the Blessed One, “tell us why the people of Vaiśālī sentenced young Good Compassion to death because he could not be satisfied, prompting the Blessed One to rescue him and established him in the unsurpassed, supreme welfare of nirvāṇa.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ད་ལྟར་འབའ་ཞིག་མ་ཡིན་ཏེ། འདས་པའི་དུས་ན་ཡང་འདི་མ་གྲངས་ཤིང་གཡེམ་པར་གྱུར་ནས་སྐྱེ་བོ་ཕལ་པོ་ཆེས་གསོད་དུ་བཏང་བ་ལས། ངས་སྐྱབས་བྱས་ཏེ། བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་ཇི་ལྟར་བཞག་པ་ཉོན་ཅིག །
en: “Not only now,” the Blessed One explained, “but in times past as well, and in the same way, he could not be satisfied, practiced sexual misconduct, and was sent by a crowd to be killed, whereupon I rescued him and placed him in the four meditative states and five superknowledges.

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན་རི་ཁྲོད་ཀྱི་གྲོང་ཞིག་ན། ཡུལ་མི་ཁ་མི་མཁས་ཤིང་གཡེམ་པ་ཞིག་འདུག་ནས། སྐྱེ་བོ་མང་པོ་གླགས་ཚོལ་ཞིང་འདུག་པ་ལས།
en: “Monks, in times gone by, in a mountain village there lived a certain villager who lacked in discernment, practiced sexual misconduct, and intended harm to many.

source: དེ་དག་གིས་གླགས་རྙེད་ནས་གཞན་གྱི་ཆུང་མ་ལ་བྱི་པོ་བྱེད་པ་ལས་བཟུང་སྟེ།
en: But the villagers found a way to harm him instead, and they caught him in the act of adultery with another man’s wife.

source: རྒྱལ་པོ་ལ་ཕུལ་ནས་རྒྱལ་པོས་དེ་གསོད་དུ་བཏང་སྟེ།
en: They presented him to the king, and the king sent him to be killed.

source: དེ་གཤེད་མ་རྣམས་ཀྱིས་ཁྲིད་དེ་གསད་པའི་སར་ཕྱིན་དུ་ཉེ་བ་དང་། རི་ཁྲོད་ཀྱི་གྲོང་དེ་ནས་ཐག་མི་རིང་བ་དཀའ་ཐུབ་ཀྱི་གནས་ཞིག་ན་དྲང་སྲོང་ཞིག་གནས་ཏེདྲང་སྲོང་དེ་སྤྱོད་ཡུལ་ལ་ཆས་ནས་མི་དེ་དེས་མཐོང་ནས།
en: The executioners led him away, and as they neared the place where he was to be executed, he spotted a sage who had been going about his business and living in a place on the mountain, devoted to austerities, not far from the villages.

source: མཐོང་མ་ཐག་ཏུ་རྐང་པ་ལ་ཕྱག་འཚལ་ཏེ། སྨྲས་པ་དྲང་སྲོང་བདག་ལ་དཀའ་བ་མཛད་པ་དང་། སྲོག་གི་སྦྱིན་པ་མཛད་དུ་གསོལ།
en: As soon as he saw him, he bowed down at his feet, and said, ‘O sage, please undertake the difficult task of saving my precious life!’

source: དེ་ནས་དྲང་སྲོང་དེས་རྒྱལ་པོ་ལ་གཏོད་དུ་བཅུག་ནས། དཀའ་ཐུབ་ཀྱི་གནས་སུ་ཁྲིད་དེ་རབ་ཏུ་ཕྱུང་ནས། དེར་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་བསྐྱེད་དོ། །
en: At this the sage led the king to release him, brought him to the place of his retreat, welcomed his renunciation, and there he generated the four meditative states and five superknowledges.

source: དེའི་ཚེ་དྲང་སྲོང་དུ་གྱུར་པ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་གནས་པ་གང་ཡིན་པ་དེ་ནི་ང་ཡིན་ནོ། །
en: I am the one who was that sage then, and lived the life of a bodhisattva.

source: དེའི་ཚེ་མི་དེ་ནི་ཁྱེའུ་སྙིང་རྗེ་བཟང་པོ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that man then is none other than this young man.

source: དེའི་ཚེ་ཡང་འདི་སྐྱེ་བོ་ཕལ་པོ་ཆེས་གསོད་དུ་བཏང་བ་ལས།
en: At that time a crowd sentenced him to death,

source: ངས་སྐྱབས་བྱས་ནས་བསམ་གཏན་བཞི་དང་མངོན་པར་ཤེས་པ་ལྔ་ལ་བཞག་གོ། །
en: and I rescued him and placed him in the four meditative states and five superknowledges.

source: ད་ལྟར་ཡང་འདི་མ་གྲངས་པའི་ཕྱིར་ཡངས་པ་ཅན་གྱི་མི་རྣམས་ཀྱིས་གསོད་དུ་བཏང་བ་ལས་
en: Now as well, because he could not be satisfied, a crowd sentenced him to death,

source: ངས་དེ་ལས་ཐར་བར་བྱས་ནས་གཡུང་དྲུང་གི་མཐར་ཕྱིན་པ་གྲུབ་པ་དང་བདེ་བའི་མྱ་ངན་ལས་འདས་པ་ལ་བཞག་གོ། །
en: and I have rescued him and established him in the unsurpassed, supreme welfare of nirvāṇa.

source: གཞན་ཡང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་གསུང་རབ་ལ་འདི་རབ་ཏུ་བྱུང་ནས།
en: “He also went forth in the doctrine of the totally and completely awakened Buddha Kāśyapa,

source: དེར་འདིས་ཚེ་གཅིག་ཏུ་ཚངས་པར་སྤྱོད་པ་སྤྱད་ནས་འཆི་ཀར་སྨོན་ལམ་བཏབ་པ།
en: and after practicing pure conduct all his life, at the time of his death he prayed,

source: དེའི་ཚེ་དགེ་སློང་དུ་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་སྙིང་རྗེ་བཟང་པོ་འདི་ཁོ་ན་ཡིན་ཏེ།
en: The one who was that monk then is none other than this Good Compassion himself.

source: གེལ་པོ་ཞེས་བྱ་བ་ནི།
en: The Story of Fleshy

source: གླེང་གཞི་མཉན་དུ་ཡོད་པ་ན་བཞུགས་ཏེ། དེའི་ཚེ་མཉན་དུ་ཡོད་པ་ན་བྲམ་ཟེ་ཞིག་གནས་པ་དེ་བུ་མེད་དེ་བུ་འདོད་པའི་ཕྱིར་ལྷའི་གནས་སོ་ཅོག་ཏུ་གསོལ་བ་འདེབས་སོ། །
en: When the Blessed One was in Śrāvastī, a certain brahmin lived in Śrāvastī who had no children but desired a son. The householder made supplications to all the deities,

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་ཆུང་མ་ལ་བུ་ཆགས་ནས།
en: and finally one day his wife conceived.

source: དེ་ཟླ་བ་དགུའམ་བཅུ་ལོན་པ་དང་ཁྱེའུ་གཟུགས་བཟང་ཞིང་བལྟ་ན་སྡུག་ལ་མཛེས་པ་ཚོ་ཞིང་པགས་པ་དང་ཤ་དང་ཁྲག་རྒྱས་པ་ཞིག་བཙས་ཏེ།
en: After nine or ten months had passed, she gave birth to a child who was well proportioned, pleasing to the eye, and beautiful. He was already corpulent, full-fledged in skin, flesh, and blood.

source: དེའི་བཙས་སྟོན་རྒྱས་པར་བྱས་ནས། ཁྱེའུ་འདིའི་མིང་ཇི་སྐད་གདགས་ཞེས་མིང་འདོགས་པར་བྱེད་དེ་ཁྱེའུ་འདི་ཚོ་ཞིང་པགས་པ་དང་ཤ་དང་ཁྲག་རྒྱས་པས་ན། དེའི་ཕྱིར་ཁྱེའུ་འདི་གེལ་པོ་ཞེས་གདགས་སོ་ཞེས་ཟེར་རོ། །
en: At the elaborate feast celebrating his birth they asked, “What name should we give this child?” And they named him, saying, “Since he is so corpulent, and full-fledged in skin, flesh, and blood, his name will be Fleshy.”

source: དེ་ནས་ཁྱེའུ་གེལ་པོ་འོ་མ་དང་ཞོ་དང་མར་དང་ཞུན་མར་དང་མར་གྱི་ཉིང་གུས་བསྐྱེད་བསྲིངས་ནས།
en: They reared young Fleshy on milk, yogurt, butter, ghee, and milk solids,

source: དེ་གང་གི་ཚེ་ཆེར་སྐྱེས་པ་དེའི་ཚེ་ཡི་གེ་དང་། བྲམ་ཟེའི་སྤྱོད་ལམ་དང་། སྤྱོད་པ་དང་། ཨོཾ་ཞེས་བྱ་བ་དང་། བྷོ་ཞེས་བྱ་བ་དང་། གཙང་སྦྲ་དང་། ཆོ་ག་དང་། ཐལ་བ་བླང་བ་དང་། རིལ་བ་ཐོགས་པ་དང་། ངེས་བརྗོད་ཀྱི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་གྱི་རིག་བྱེད་དང་། སྙན་ཚིག་གི་རིག་བྱེད་དང་། སྲིད་སྲུང་གི་རིག་བྱེད་དང་། མཆོད་སྦྱིན་བྱ་བ་དང་། མཆོད་སྦྱིན་བྱེད་དུ་གཞུག་པ་དང་། སྦྱིན་པ་དང་། བླང་བ་དང་། ཁ་ཏོན་བྱ་བ་དང་། ཁ་ཏོན་སློབ་ཏུ་གཞུག་པའི་ཐབས་བསླབས་ནས་ལས་རྣམ་པ་དྲུག་ལ་མཁས་པའི་བྲམ་ཟེར་གྱུར་ཏེདེ་མཐར་གྱིས་རིག་པའི་གནས་བཅྭ་བརྒྱད་ལ་བྱང་བར་གྱུར་ཏོ། །
en: and as he grew up, he studied letters, brahminical customs and conduct, the syllables oṃ and bho , ritual purity, ritual actions , the collection of ashes, holding the ritual vase, the Ṛg Veda , the Yajur Veda , the Sāma Veda , the Atharva Veda , how to perform sacrificial rites, how to lead others in performing sacrificial rites, how to give and receive offerings, recitation, and recitation instruction. Trained in these procedures, he became a master of the six types of brahminical activities, and in time he mastered the eighteen sciences.

source: བྲམ་ཟེ་དེའི་ཁྱིམ་ཡང་ཁྱིམ་བདག་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཁྱིམ་ནས་ཐག་མི་རིང་བ་ཞིག་ན་འདུག་སྟེ།
en: The brahmin’s house was not far from the house of Anāthapiṇḍada,

source: བྲམ་ཟེའི་ཁྱེའུ་དེ་ཡང་མགོན་མེད་ཟས་སྦྱིན་དང་འགྲོགས་པས་བཅོམ་ལྡན་འདས་ཀྱི་བསྟན་པ་ལ་དགའ་བར་གྱུར་ཏོ། །
en: and the young brahmin was an acquaintance of Anāthapiṇḍada, so he too was fond of the doctrine of the Blessed One.

source: དེ་ནས་ཕྱི་ཞིག་ན་དེའི་ཕ་མ་གཉིས་ཤིའོ་དེ་གཉིས་ཤི་ནས་དེ་དོན་ཞིག་ལ་གྲོང་ཁྱེར་ཤུར་པ་ར་ཀར་ཆས་ཏེ།
en: Then one day both the young brahmin’s parents died. After their death, he had to go to the city of Śūrpāraka on an errand.

source: དེ་མཐར་གྱིས་རྒྱུ་ཞིང་སོང་སོང་བ་ལས་མཉན་དུ་ཡོད་པ་དང་ཤུར་པ་ར་ཀའི་གྲོང་ཁྱེར་གྱི་བར་གྱི་རིའི་སུལ་ཞིག་ན་ནགས་ཁུང་ཞིག་ཡོད་དེ།
en: He traveled and traveled until eventually he came to a certain dense forest in the mountainous region between Śrāvastī and Śūrpāraka.

source: ནགས་ཁུང་དེ་ན་དྲང་སྲོང་ཞིག་གནས་པ་སྟེ།
en: In that dense forest there lived a certain sage.
